var name = 'YoungJun';

var letter = `2009년 ${name}

은 플리커의 파일 업로드 진행 표시줄을 보았을 때, 파일이 얼마나 업로드되었는지 알기 위해서는 서버에 쿼리를 전송해야 한다는 점을 보고 조금 더 쉬운 방법을 찾다가 고안해 내었으며,[4] 그가 일하던 Joyent라는 회사에서 개발 및 운영을 담당하고 있다.[5]최초 버전은 2009년 리눅스 기반으로 출시되었고, Inangural JSConf EU conference에서 Ryan Dahl의 발표[6] 직후 국제적인 관심을 끌기 시작했다.[7] 패키지 매니저인 npm은 2011년에 처음 소개되었다.2011년 6월 마이크로소프트는 Joyent와 파트너십을 맺고[8] 같은 해 7월 윈도용 최초 버전을 출시했다.2014년 12월, Fedor Indutny는 Node.js의 포크인 io.js를 시작했다.2015년 9월, Node.js v0.12와 io.js v3.3은 병합되어 Node v4.0으로 합쳐졌다.[9]2019년 4월, Node.js v12 부터 ECMA스크립트의 공식 모듈 시스템 사용을 실험적으로 지원하기 시작했다. (그 이전까지는 서드파티인 CommonJS 모듈만을 사용해오고 있었다.)${2 + 2}`
console.log(letter)

var a = 1;